# Data wrangling Project 2
This file is used for exploring and refining the datasets.

Importing Libraries

In [157]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
from datetime import datetime
from IPython.display import display
warnings.filterwarnings('ignore')

In [158]:
# # Changing data txt files to csv
# df = pd.read_csv('Datasets/Datasets_raw/df_final_demo.txt', delimiter='\t')  # or use ' ' for space
# # Save as CSV
# df.to_csv('Datasets/Datasets_raw/df_final_demo.csv', index=False)
# df = pd.read_csv('Datasets/Datasets_raw/df_final_demo.csv')  # assumes comma
# #df.to_csv('your_file.csv', index=False)

# # Experiment Clients 
# df = pd.read_csv('Datasets/Datasets_raw/df_final_experiment_clients.txt', delimiter='\t')  # or use ' ' for space
# # Save as CSV
# df.to_csv('Datasets/Datasets_raw/df_final_experiment_clients.csv', index=False)
# df = pd.read_csv('Datasets/Datasets_raw/df_final_experiment_clients.csv')

# #webdata_pt 1
# df = pd.read_csv('Datasets/Datasets_raw/df_final_web_data_pt_1.txt', delimiter='\t')  # or use ' ' for space
# # Save as CSV
# df.to_csv('Datasets/Datasets_raw/df_final_web_data_pt_1.csv', index=False)
# df = pd.read_csv('Datasets/Datasets_raw/df_final_web_data_pt_1.csv')

# #webdata_pt 2
# df = pd.read_csv('Datasets/Datasets_raw/df_final_web_data_pt_2.txt', delimiter='\t')  # or use ' ' for space
# # Save as CSV
# df.to_csv('Datasets/Datasets_raw/df_final_web_data_pt_2.csv', index=False)
# df = pd.read_csv('Datasets/Datasets_raw/df_final_web_data_pt_2.csv')

# Loading the datasets

In [159]:
# # Defining the file path 
# file_path_client = 'Datasets/Datasets_raw/df_final_demo.csv'
# file_path_ec = 'Datasets/Datasets_raw/df_final_experiment_clients.csv'
# file_path_fwd1 = 'Datasets/Datasets_raw/df_final_web_data_pt_1.csv'
# file_path_fwd2 = 'Datasets/Datasets_raw/df_final_web_data_pt_2.csv'

# # Loading the CSV files into DataFrames
# df_client = pd.read_csv(file_path_client, sep=',', engine='python')
# df_ec = pd.read_csv(file_path_ec, sep=',', engine='python')
# df_fwd1 = pd.read_csv(file_path_fwd1, sep=',', engine='python')
# df_fwd2 = pd.read_csv(file_path_fwd2, sep=',', engine='python')

Just with .txt files, without converting it to csv (works perfectly fine)

In [160]:
# Defining the file path 
file_path_client = 'Datasets/Datasets_raw/df_final_demo.txt'
file_path_ec = 'Datasets/Datasets_raw/df_final_experiment_clients.txt'
file_path_fwd1 = 'Datasets/Datasets_raw/df_final_web_data_pt_1.txt'
file_path_fwd2 = 'Datasets/Datasets_raw/df_final_web_data_pt_2.txt'

# Loading the CSV files into DataFrames
df_client = pd.read_csv(file_path_client)
df_ec = pd.read_csv(file_path_ec)
df_fwd1 = pd.read_csv(file_path_fwd1)
df_fwd2 = pd.read_csv(file_path_fwd2)

In [161]:
print(df_client.columns.tolist())
print(df_ec.columns.tolist())

['client_id', 'clnt_tenure_yr', 'clnt_tenure_mnth', 'clnt_age', 'gendr', 'num_accts', 'bal', 'calls_6_mnth', 'logons_6_mnth']
['client_id', 'Variation']

In [162]:
df_client

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0
...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

In [163]:
df_ec

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

In [164]:
df_fwd1

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
343136,2443347,465784886_73090545671,136329900_10529659391_316129,confirm,2017-03-31 15:15:46
343137,2443347,465784886_73090545671,136329900_10529659391_316129,step_3,2017-03-31 15:14:53
343138,2443347,465784886_73090545671,136329900_10529659391_316129,step_2,2017-03-31 15:12:08
343139,2443347,465784886_73090545671,136329900_10529659391_316129,step_1,2017-03-31 15:11:37
343140,2443347,465784886_73090545671,136329900_10529659391_316129,start,2017-03-31 15:10:47

In [165]:
df_fwd2

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58
...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [166]:
#Merging the dataframes
def df_merge_and_clean_client(df_client=df_client, df_ec=df_ec):
    ''' Merges client and experiment dataframes and adds balance quartiles ''' 
    
    # Merging the dataframes on 'client_id' using outer join
    df_merged_client = pd.merge(df_client, df_ec, on='client_id', how='outer')
    
    # Keeping the rows with 5 or fewer missing values
    df_client_cleaned = df_merged_client[df_merged_client.isnull().sum(axis=1) <= 5]
    
    # Adding balance quartile column based on 'balance' column
    df_client_cleaned['balance_quartile'] = pd.qcut(
        df_client_cleaned['bal'], 
        q=4, 
        labels=['Q1', 'Q2', 'Q3', 'Q4']
    )
    
    return df_client_cleaned

In [167]:
df_client_cleaned = df_merge_and_clean_client(df_client, df_ec)

In [168]:
df_client_cleaned.to_csv('Datasets/Datasets_clean/df_clean_client.csv', index=False)

In [175]:
#Concatenating the dataframes 
def df_fwd_all(df_fwd1 = df_fwd1, df_fwd2 = df_fwd2, df_ec = df_ec):
    '''Combines web data from part 1 and 2, merges it with experiment data,
    parses and sorts date/time, and drops web data without Control/Test distinction.
    ''' 
    # Step 1: Combining both web datasets together. 
    df_fwd = pd.concat([df_fwd1, df_fwd2], axis=0, ignore_index=True)
    # Step 2: Merging it with experiment/control info (right join keeps only experimental clients)
    df_fwd_ec = pd.merge(df_fwd, df_ec, on='client_id', how='right')
    # Step 3: Converting date_time to datetime object
    df_fwd_ec['date_time'] = pd.to_datetime(df_fwd_ec['date_time'])
    # Step 4: Sorting by client, visit and time.
    df_fwd_ec = df_fwd_ec.sort_values(by=['client_id', 'visit_id', 'date_time'])
    # Step 5: Dropping rows where variation is missing.
    df_fwd_ec = df_fwd_ec.dropna(subset=['Variation'])
    return (df_fwd_ec)

In [176]:
df_web_cleaned = df_fwd_all()
df_web_cleaned

,client_id,visitor_id,visit_id,process_step,date_time,Variation
94261,555,402506806_56087378777,637149525_38041617439_716659,start,2017-04-15 12:57:56,Test
94260,555,402506806_56087378777,637149525_38041617439_716659,step_1,2017-04-15 12:58:03,Test
94259,555,402506806_56087378777,637149525_38041617439_716659,step_2,2017-04-15 12:58:35,Test
94258,555,402506806_56087378777,637149525_38041617439_716659,step_3,2017-04-15 13:00:14,Test
94257,555,402506806_56087378777,637149525_38041617439_716659,confirm,2017-04-15 13:00:34,Test
...,...,...,...,...,...,...
140280,9999729,834634258_21862004160,870243567_56915814033_814203,confirm,2017-05-08 16:09:40,Test
140275,9999729,604429154_69247391147,99583652_41711450505_426179,start,2017-04-05 13:40:49,Test
140274,9999729,604429154_69247391147,99583652_41711450505_426179,step_1,2017-04-05 13:41:04,Test
14818,9999832,145538019_54444341400,472154369_16714624241_585315,start,2017-05-16 16:46:03,Test
14817,9999832,145538019_54444341400,472154369_16714624241_585315,step_1,2017-05-16 16:46:11,Test

In [ ]:
print(df_web_cleaned.shape) # number of rows and columns
print(df_web_cleaned.head()) # first 5 rows
print(df_web_cleaned.isnull().sum()) # number of missing values in each column

(321309, 6)
       client_id             visitor_id                      visit_id  \
94261        555  402506806_56087378777  637149525_38041617439_716659
94260        555  402506806_56087378777  637149525_38041617439_716659
94259        555  402506806_56087378777  637149525_38041617439_716659
94258        555  402506806_56087378777  637149525_38041617439_716659
94257        555  402506806_56087378777  637149525_38041617439_716659

      process_step           date_time Variation
94261        start 2017-04-15 12:57:56      Test
94260       step_1 2017-04-15 12:58:03      Test
94259       step_2 2017-04-15 12:58:35      Test
94258       step_3 2017-04-15 13:00:14      Test
94257      confirm 2017-04-15 13:00:34      Test
client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
Variation       0
dtype: int64

In [ ]:
#saving the cleaned web data 
# df_web_cleaned.to_csv('Datasets/Datasets_clean/df_clean_web.csv', index=False)

In [191]:
print(df_web_cleaned.columns.tolist())

['client_id', 'visitor_id', 'visit_id', 'process_step', 'date_time', 'Variation']

In [221]:
# Checking for duplicates
duplicates = df_web_cleaned[df_web_cleaned.duplicated()]
print("Total duplicated rows:", len(duplicates))

Total duplicated rows: 4074

In [ ]:
# new_df = df.copy()
# new_df

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58
...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [226]:
new_df = df.copy()

In [227]:
df.duplicated().sum()

8669

In [222]:
def remove_duplicates(df):
    '''REMOVING DUPLICATES, 'start' and 'confirm' steps, only keeping the last each visit'''

    new_df = df.copy()

    df_not_started = new_df[new_df['process_step'] != 'start']
    filter_start = new_df[new_df['process_step'] == 'start'].drop_duplicates(subset=['vist_id'], keep='last')
    new_df = pd.concat([df_not_started, filter_start])
    new_df = new_df.sort_values(by=['client_id', 'visit_id', 'date_time'])

    not_confirm_df = new_df[new_df['process_step'] != 'confirm']
    filter_confirm = new_df[new_df['process_step'] == 'confirm'].drop_duplicates(subset=['visit_id'], keep='last')

    new_df = pd.concat([not_confirm_df, filter_confirm])
    new_df = new_df.sort_values(by=['client_id', 'visit_id', 'date_time'])
    return(new_df)

In [223]:
new_df

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58
...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [224]:
duplicates2 = new_df[new_df.duplicated()]
print("Total duplicated rows:", len(duplicates))

Total duplicated rows: 4074

# Exploring the datasets

Checking df_demo dataset

In [ ]:
df_demo.info()
df_demo.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 1 columns):
 #   Column                                                                                             Non-Null Count  Dtype
---  ------                                                                                             --------------  -----
 0   client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth  70609 non-null  object
dtypes: object(1)
memory usage: 551.8+ KB

  client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0         836976,6.0,73.0,60.5,U,2.0,45105.3,6.0,9.0
1       2304905,7.0,94.0,58.0,U,2.0,110860.3,6.0,9.0
2  1439522,5.0,64.0,32.0,U,2.0,52467.78999999999,...
3     1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4    5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

Checking df_ec dataset

In [ ]:
df_ec.info()
df_ec.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  70609 non-null  int64
 1   Variation  50500 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.1+ MB

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

Checking df_fwd1 dataset

In [ ]:
df_fwd1.info()
df_fwd1.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 343141 entries, 0 to 343140
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     343141 non-null  int64
 1   visitor_id    343141 non-null  object
 2   visit_id      343141 non-null  object
 3   process_step  343141 non-null  object
 4   date_time     343141 non-null  object
dtypes: int64(1), object(4)
memory usage: 13.1+ MB

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

Checking df_fwd2 dataset

In [ ]:
df_fwd2.info()
df_fwd2.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412264 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     412264 non-null  int64
 1   visitor_id    412264 non-null  object
 2   visit_id      412264 non-null  object
 3   process_step  412264 non-null  object
 4   date_time     412264 non-null  object
dtypes: int64(1), object(4)
memory usage: 15.7+ MB

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [ ]:
# For each DataFrame
for name, df in [('df_demo', df_demo), ('df_ec', df_ec), ('df_fwd1', df_fwd1), ('df_fwd2', df_fwd2)]:
    print(f"\n===== {name} =====")
    print("\nShape:", df.shape)
    print("\nColumns and Data Types:\n", df.dtypes)
    print("\nMissing Values:\n", df.isnull().sum())
    print("\nPreview:\n", df.head(3))

===== df_demo =====

Shape: (70609, 1)

Columns and Data Types:
 client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth    object
dtype: object

Missing Values:
 client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth    0
dtype: int64

Preview:
   client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0         836976,6.0,73.0,60.5,U,2.0,45105.3,6.0,9.0
1       2304905,7.0,94.0,58.0,U,2.0,110860.3,6.0,9.0
2  1439522,5.0,64.0,32.0,U,2.0,52467.78999999999,...

===== df_ec =====

Shape: (70609, 2)

Columns and Data Types:
 client_id     int64
Variation    object
dtype: object

Missing Values:
 client_id        0
Variation    20109
dtype: int64

Preview:
    client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control

===== df_fwd1 =====

Shape: (343141, 5)

Columns and Data Types:
 client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

Missing Values:
 client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

Preview:
    client_id            visitor_id                      visit_id process_step  \
0    9988021  580560515_7732621733  781255054_21935453173_531117       step_3
1    9988021  580560515_7732621733  781255054_21935453173_531117       step_2
2    9988021  580560515_7732621733  781255054_21935453173_531117       step_3

             date_time
0  2017-04-17 15:27:07
1  2017-04-17 15:26:51
2  2017-04-17 15:19:22

===== df_fwd2 =====

Shape: (412264, 5)

Columns and Data Types:
 client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

Missing Values:
 client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

Preview:
    client_id             visitor_id                      visit_id  \
0     763412  601952081_10457207388  397475557_40440946728_419634
1    6019349  442094451_91531546617  154620534_35331068705_522317
2    6019349  442094451_91531546617  154620534_35331068705_522317

  process_step            date_time
0      confirm  2017-06-06 08:56:00
1      confirm  2017-06-01 11:59:27
2       step_3  2017-06-01 11:58:48

In [ ]:
df_ec = pd.read_csv(file_path_ec, sep=",", engine="python")

In [ ]:
# with open(file_path_ec, 'r') as f:
#     for _ in range(5):
#         print(f.readline())

In [ ]:
df_ec.head()
df_ec.columns
df_ec.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  70609 non-null  int64
 1   Variation  50500 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.1+ MB